### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

In [2]:
# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas DataFrames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset.  
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])

In [3]:
school_data_complete.shape

(39170, 11)

In [11]:
school_data.head(2)

   School ID           school_name      type  size   budget
0          0     Huang High School  District  2917  1910635
1          1  Figueroa High School  District  2949  1884411

In [64]:
school_data.shape

(15, 5)

In [12]:
student_data.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61

In [65]:
student_data.shape

(39170, 7)

In [4]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
df=school_data_complete.copy()
df.shape

(39170, 11)

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Calculate the percentage of students who passed math **and** reading (% Overall Passing)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [6]:
total_num_schools = df['School ID'].count()
print(total_num_schools)

total_num_students = df['Student ID'].count()
print(total_num_students)

total_budget= df['budget'].sum()
print(total_budget)

avg_math_score = df['math_score'].mean()
print(avg_math_score)

avg_reading_score = df['reading_score'].mean()
print(avg_reading_score)

39170
39170
1327950934
78.98537145774827
81.87784018381414

In [7]:
math_score_70=df.loc[(df['math_score']>=70)]
math_score_70_count=math_score_70['Student ID'].count()
math_score_70_pct=math_score_70_count/total_num_students
print(math_score_70_pct)

0.749808526934

In [8]:
reading_score_70=df.loc[(df['reading_score']>=70)]    
reading_score_70_count = reading_score_70['Student ID'].count()
reading_score_70_pct = reading_score_70_count/total_num_students
print(reading_score_70_pct)

0.858054633648

In [9]:
# 
overall_pass=df[(df.math_score >=70) & (df.reading_score>=70)]
overall_pass_count = overall_pass['Student ID'].count()
overall_pass_pct = overall_pass_count/total_num_students
print(overall_pass_pct)

0.651723257595

In [10]:
# Create 
district_summary_df = pd.DataFrame({"total_num_schools": total_num_schools,
                                  "total_num_students": total_num_students,
                                  "total_budget": total_budget,
                                  "avg_math_score":avg_math_score,
                                  "avg_reading_score":avg_reading_score,
                                  "math_score_70_pct": math_score_70_pct,
                                  "reading_score_70_pct": reading_score_70_pct,
                                  "overall_pass_pct": overall_pass_pct}, index=[0])
district_summary_df

,avg_math_score,avg_reading_score,math_score_70_pct,overall_pass_pct,reading_score_70_pct,total_budget,total_num_schools,total_num_students
0,78.985371,81.87784,0.749809,0.651723,0.858055,1327950934,39170,39170

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * % Overall Passing (The percentage of students that passed math **and** reading.)
  
* Create a dataframe to hold the above results

In [295]:
# Create a GroupBy object based upon School Name and School Type
school_type=school_data_complete.groupby(['school_name','type','budget'])
#school_type.head(2)

In [296]:
# Total Students

school_type_df = pd.DataFrame(school_type['Student ID'].count())
school_type_df = school_type_df.rename(columns={"Student ID": "Total Students"})

school_type_df=school_type_df.reset_index()
school_type_df.head(5)

            school_name      type   budget  Total Students
0    Bailey High School  District  3124928            4976
1   Cabrera High School   Charter  1081356            1858
2  Figueroa High School  District  1884411            2949
3      Ford High School  District  1763916            2739
4   Griffin High School   Charter   917500            1468

In [297]:
# Total School Budget

school_type_df = school_type_df.rename(columns={"budget": "Total Budget"})
school_type_df.head()

            school_name      type  Total Budget  Total Students
0    Bailey High School  District       3124928            4976
1   Cabrera High School   Charter       1081356            1858
2  Figueroa High School  District       1884411            2949
3      Ford High School  District       1763916            2739
4   Griffin High School   Charter        917500            1468

# Merge Total Students and Total School Budget
school_district=pd.merge(school_type_df,school_type_budget_df, on=["school_name","type"])
school_district.head()

school_district.shape

In [298]:
# Per Student Budget
school_type_df['Per Student Budget']=school_type_df['Total Budget']/school_type_df['Total Students']
school_type_df['Per Student Budget']=school_type_df['Per Student Budget'].astype(float).map("${:,.2f}".format)
school_type_df['Total Budget']=school_type_df['Total Budget'].astype(float).map("${:,.2f}".format)

school_type_df.head(3)

,school_name,type,Total Budget,Total Students,Per Student Budget
0,Bailey High School,District,"$3,124,928.00",4976,$628.00
1,Cabrera High School,Charter,"$1,081,356.00",1858,$582.00
2,Figueroa High School,District,"$1,884,411.00",2949,$639.00

In [299]:
#Average Math Score
school_type_math_df = pd.DataFrame(school_type['math_score'].mean())
school_type_math_df = school_type_math_df.rename(columns={"math_score": "Average Math Score"})

school_type_math_df=school_type_math_df.reset_index()
school_type_math_df.head(3)

            school_name      type   budget  Average Math Score
0    Bailey High School  District  3124928           77.048432
1   Cabrera High School   Charter  1081356           83.061895
2  Figueroa High School  District  1884411           76.711767

In [300]:
#Average Reading Score
school_type_reading_df = pd.DataFrame(school_type['reading_score'].mean())
school_type_reading_df = school_type_reading_df.rename(columns={"reading_score": "Average Reading Score"})

school_type_reading_df=school_type_reading_df.reset_index()
school_type_reading_df.head(3)

            school_name      type   budget  Average Reading Score
0    Bailey High School  District  3124928              81.033963
1   Cabrera High School   Charter  1081356              83.975780
2  Figueroa High School  District  1884411              81.158020

In [301]:
school_type_df['Average Math Score']=school_type_math_df['Average Math Score']
school_type_df['Average Reading Score']=school_type_reading_df['Average Reading Score']
school_type_df.head(3)

,school_name,type,Total Budget,Total Students,Per Student Budget,Average Math Score,Average Reading Score
0,Bailey High School,District,"$3,124,928.00",4976,$628.00,77.048432,81.033963
1,Cabrera High School,Charter,"$1,081,356.00",1858,$582.00,83.061895,83.975780
2,Figueroa High School,District,"$1,884,411.00",2949,$639.00,76.711767,81.158020

# % Passing Math

In [302]:
#math_score_school_70
math_score_school_70=df.loc[(df['math_score']>=70)]
math_score_school_70.shape

(29370, 11)

In [303]:
# Create a GroupBy object based upon School Name and School Type on math_score_school_70
school_type_math_pass=math_score_school_70.groupby(['school_name','type'])

In [304]:
school_type_math_pass_df = pd.DataFrame(school_type_math_pass['Student ID'].count())
school_type_math_pass_df = school_type_math_pass_df.rename(columns={"Student ID": "Students Passing Math"})

school_type_math_pass_df=school_type_math_pass_df.reset_index()
school_type_math_pass_df.head(3)

            school_name      type  Students Passing Math
0    Bailey High School  District                   3318
1   Cabrera High School   Charter                   1749
2  Figueroa High School  District                   1946

In [306]:
#Adding column to school_district df
school_type_df['Students Passing Math']=school_type_math_pass_df['Students Passing Math']
school_type_df['% Passing Math']=(school_type_df['Students Passing Math']/school_type_df['Total Students'])*100
school_type_df.head(3)

,school_name,type,Total Budget,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Students Passing Math,% Passing Math
0,Bailey High School,District,"$3,124,928.00",4976,$628.00,77.048432,81.033963,3318,66.680064
1,Cabrera High School,Charter,"$1,081,356.00",1858,$582.00,83.061895,83.975780,1749,94.133477
2,Figueroa High School,District,"$1,884,411.00",2949,$639.00,76.711767,81.158020,1946,65.988471

# % Passing Reading

In [307]:
#reading_score_school_70
reading_score_school_70=df.loc[(df['reading_score']>=70)]
reading_score_school_70.shape

(33610, 11)

In [308]:
# Create a GroupBy object based upon School Name and School Type on math_score_school_70
school_type_reading_pass=reading_score_school_70.groupby(['school_name','type'])

In [309]:
school_type_reading_pass_df = pd.DataFrame(school_type_reading_pass['Student ID'].count())
school_type_reading_pass_df = school_type_reading_pass_df.rename(columns={"Student ID": "Students Passing Reading"})

school_type_reading_pass_df=school_type_reading_pass_df.reset_index()
school_type_reading_pass_df.head(3)

            school_name      type  Students Passing Reading
0    Bailey High School  District                      4077
1   Cabrera High School   Charter                      1803
2  Figueroa High School  District                      2381

In [310]:
#Adding column to school_district df
school_type_df['Students Passing Reading']=school_type_reading_pass_df['Students Passing Reading']
school_type_df['Total Students']=school_type_df['Total Students'].astype(float)
school_type_df['% Passing Reading']=(school_type_df['Students Passing Reading']/school_type_df['Total Students'])*100
school_type_df.head(3)

,school_name,type,Total Budget,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Students Passing Math,% Passing Math,Students Passing Reading,% Passing Reading
0,Bailey High School,District,"$3,124,928.00",4976.0,$628.00,77.048432,81.033963,3318,66.680064,4077,81.933280
1,Cabrera High School,Charter,"$1,081,356.00",1858.0,$582.00,83.061895,83.975780,1749,94.133477,1803,97.039828
2,Figueroa High School,District,"$1,884,411.00",2949.0,$639.00,76.711767,81.158020,1946,65.988471,2381,80.739234

# % Overall Passing (The percentage of students that passed math and reading.)

In [311]:
# Overall Passing 
overall_score_school_70=df.loc[(df['math_score']>=70) & (df['reading_score']>=70)]
overall_score_school_70.shape

(25528, 11)

In [312]:
# Create a GroupBy object based upon School Name and School Type on overall_score_school_70
school_type_overall=overall_score_school_70.groupby(['school_name','type'])

In [313]:
school_type_overall_pass_df = pd.DataFrame(school_type_overall['Student ID'].count())
school_type_overall_pass_df = school_type_overall_pass_df.rename(columns={"Student ID": "Students Passing Overall"})

school_type_overall_pass_df=school_type_overall_pass_df.reset_index()
school_type_overall_pass_df.head(3)

            school_name      type  Students Passing Overall
0    Bailey High School  District                      2719
1   Cabrera High School   Charter                      1697
2  Figueroa High School  District                      1569

In [314]:
#Adding column to school_district df
school_type_df['Students Passing Overall']=school_type_overall_pass_df['Students Passing Overall']
school_type_df['% Overall Passing']=(school_type_df['Students Passing Overall']/school_type_df['Total Students'])*100

school_type_df.head(3)

,school_name,type,Total Budget,Total Students,Per Student Budget,Average Math Score,Average Reading Score,Students Passing Math,% Passing Math,Students Passing Reading,% Passing Reading,Students Passing Overall,% Overall Passing
0,Bailey High School,District,"$3,124,928.00",4976.0,$628.00,77.048432,81.033963,3318,66.680064,4077,81.933280,2719,54.642283
1,Cabrera High School,Charter,"$1,081,356.00",1858.0,$582.00,83.061895,83.975780,1749,94.133477,1803,97.039828,1697,91.334769
2,Figueroa High School,District,"$1,884,411.00",2949.0,$639.00,76.711767,81.158020,1946,65.988471,2381,80.739234,1569,53.204476

In [177]:
print(school_type_df.columns)

Index(['school_name', 'type', 'Total Students', 'Total Budget',
       'Per Student Budget', 'Average Math Score', 'Average Reading Score',
       'Students Passing Math', '% Passing Math', 'Students Passing Reading',
       '% Passing Reading', 'Students Passing Overall', '% Overall Passing'],
      dtype='object')

In [315]:
school_type_df1=school_type_df[['school_name', 'type', 'Total Students', 'Total Budget',
       'Per Student Budget', 'Average Math Score', 'Average Reading Score',
       '% Passing Math', '% Passing Reading', '% Overall Passing']]
    

school_type_df1.head(3)

,school_name,type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976.0,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858.0,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949.0,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476

In [316]:
school_summary=school_type_df1
#school_summary.index=school_summary['school_name']

In [317]:
school_summary.head()

,school_name,type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976.0,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858.0,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
2,Figueroa High School,District,2949.0,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
3,Ford High School,District,2739.0,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
4,Griffin High School,Charter,1468.0,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455

In [318]:
school_summary.to_csv('school_summary.csv')

## Top Performing Schools (By % Overall Passing)

* Sort and display the top five performing schools by % overall passing.

In [319]:
top_performing_schools=school_summary.sort_values(by=["% Overall Passing"], ascending=False)
top_performing_schools.head()

,school_name,type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
1,Cabrera High School,Charter,1858.0,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
12,Thomas High School,Charter,1635.0,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012
4,Griffin High School,Charter,1468.0,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
13,Wilson High School,Charter,2283.0,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
9,Pena High School,Charter,962.0,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541

## Bottom Performing Schools (By % Overall Passing)

* Sort and display the five worst-performing schools by % overall passing.

In [320]:
bottom_performing_schools=school_summary.sort_values(by=["% Overall Passing"])
bottom_performing_schools.head()

,school_name,type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
10,Rodriguez High School,District,3999.0,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
2,Figueroa High School,District,2949.0,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
7,Huang High School,District,2917.0,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
5,Hernandez High School,District,4635.0,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
8,Johnson High School,District,4761.0,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [232]:
# 9th grade math
columns = ['school_name','grade','math_score']
math_9=student_data.loc[student_data['grade']=='9th', columns]
math_school_9 = math_9.groupby(['school_name'])
school_math_9= pd.DataFrame(math_school_9['math_score'].mean())
school_math_9=school_math_9.rename(columns={"math_score": "9th"})
school_math_9.head(2)

                           9th
school_name
Bailey High School   77.083676
Cabrera High School  83.094697

In [233]:
# 10th grade math
columns = ['school_name','grade','math_score']
math_10=student_data.loc[student_data['grade']=='10th', columns]
math_school_10 = math_10.groupby(['school_name'])
school_math_10= pd.DataFrame(math_school_10['math_score'].mean())
school_math_10=school_math_10.rename(columns={"math_score": "10th"})
school_math_10.head(2)

                          10th
school_name
Bailey High School   76.996772
Cabrera High School  83.154506

In [234]:
# 11th grade math
columns = ['school_name','grade','math_score']
math_11=student_data.loc[student_data['grade']=='11th', columns]
math_school_11 = math_11.groupby(['school_name'])
school_math_11 = pd.DataFrame(math_school_11['math_score'].mean())
school_math_11 =school_math_11.rename(columns={"math_score": "11th"})
school_math_11.head(2)

                          11th
school_name
Bailey High School   77.515588
Cabrera High School  82.765560

In [235]:
# 12th grade math
columns = ['school_name','grade','math_score']
math_12=student_data.loc[student_data['grade']=='12th', columns]
math_school_12 = math_12.groupby(['school_name'])
school_math_12 = pd.DataFrame(math_school_12['math_score'].mean())
school_math_12 =school_math_12.rename(columns={"math_score": "12th"})
school_math_12.head(2)

                          12th
school_name
Bailey High School   76.492218
Cabrera High School  83.277487

In [236]:
math_score_by_grade=pd.concat([school_math_9,school_math_10, school_math_11, school_math_12], axis=1)
math_score_by_grade.head()

                            9th       10th       11th       12th
school_name
Bailey High School    77.083676  76.996772  77.515588  76.492218
Cabrera High School   83.094697  83.154506  82.765560  83.277487
Figueroa High School  76.403037  76.539974  76.884344  77.151369
Ford High School      77.361345  77.672316  76.918058  76.179963
Griffin High School   82.044010  84.229064  83.842105  83.356164

# PIVOT

In [244]:
math_df = student_data[['school_name','grade','math_score']]

In [245]:
math_school=math_df.groupby(['school_name','grade'])

In [246]:
school_math_df= pd.DataFrame(math_school['math_score'].mean())
school_math_df=school_math_df.reset_index()
school_math_df.head(2)

          school_name grade  math_score
0  Bailey High School  10th   76.996772
1  Bailey High School  11th   77.515588

In [247]:
math_pivot = school_math_df.pivot(index='school_name',columns='grade', values='math_score')
math_pivot=math_pivot.reset_index()
math_pivot.head(2)

grade          school_name       10th       11th       12th        9th
0       Bailey High School  76.996772  77.515588  76.492218  77.083676
1      Cabrera High School  83.154506  82.765560  83.277487  83.094697

In [248]:
math_pivot_ord=math_pivot[['school_name','9th','10th','11th','12th']]
math_pivot_ord

grade            school_name        9th       10th       11th       12th
0         Bailey High School  77.083676  76.996772  77.515588  76.492218
1        Cabrera High School  83.094697  83.154506  82.765560  83.277487
2       Figueroa High School  76.403037  76.539974  76.884344  77.151369
3           Ford High School  77.361345  77.672316  76.918058  76.179963
4        Griffin High School  82.044010  84.229064  83.842105  83.356164
5      Hernandez High School  77.438495  77.337408  77.136029  77.186567
6         Holden High School  83.787402  83.429825  85.000000  82.855422
7          Huang High School  77.027251  75.908735  76.446602  77.225641
8        Johnson High School  77.187857  76.691117  77.491653  76.863248
9           Pena High School  83.625455  83.372000  84.328125  84.121547
10     Rodriguez High School  76.859966  76.612500  76.395626  77.690748
11       Shelton High School  83.420755  82.917411  83.383495  83.778976
12        Thomas High School  83.590022  83.087886  83.498795  83.497041
13        Wilson High School  83.085578  83.724422  83.195326  83.035794
14        Wright High School  83.264706  84.010288  83.836782  83.644986

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [240]:
reading_df=student_data[['school_name','grade','reading_score']]

In [241]:
reading_school=reading_df.groupby(['school_name','grade'])

In [242]:
school_reading_df= pd.DataFrame(reading_school['reading_score'].mean())
school_reading_df=school_reading_df.reset_index()
school_reading_df.head(2)

          school_name grade  reading_score
0  Bailey High School  10th      80.907183
1  Bailey High School  11th      80.945643

In [243]:
reading_pivot = school_reading_df.pivot(index='school_name',columns='grade', values='reading_score')
reading_pivot=reading_pivot.reset_index()
reading_pivot.head(2)

grade          school_name       10th       11th       12th        9th
0       Bailey High School  80.907183  80.945643  80.912451  81.303155
1      Cabrera High School  84.253219  83.788382  84.287958  83.676136

In [13]:
reading_pivot_ord=reading_pivot[['school_name','9th','10th','11th','12th']]
reading_pivot_ord.head()

                             9th       10th       11th       12th
Bailey High School     81.303155  80.907183  80.945643  80.912451
Cabrera High School    83.676136  84.253219  83.788382  84.287958
Figueroa High School   81.198598  81.408912  80.640339  81.384863
Ford High School       80.632653  81.262712  80.403642  80.662338
Griffin High School    83.369193  83.706897  84.288089  84.013699
Hernandez High School  80.866860  80.660147  81.396140  80.857143
Holden High School     83.677165  83.324561  83.815534  84.698795
Huang High School      81.290284  81.512386  81.417476  80.305983
Johnson High School    81.260714  80.773431  80.616027  81.227564
Pena High School       83.807273  83.612000  84.335938  84.591160
Rodriguez High School  80.993127  80.629808  80.864811  80.376426
Shelton High School    84.122642  83.441964  84.373786  82.781671
Thomas High School     83.728850  84.254157  83.585542  83.831361
Wilson High School     83.939778  84.021452  83.764608  84.317673
Wright High School     83.833333  83.812757  84.156322  84.073171

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [321]:
school_summary.head(2)

,school_name,type,Total Students,Total Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,Bailey High School,District,4976.0,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
1,Cabrera High School,Charter,1858.0,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769

In [322]:
school_spending=school_summary[['Per Student Budget','Average Math Score','Average Reading Score',\
                                '% Passing Math','% Passing Reading','% Overall Passing']]
school_spending.head(2)

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
1,$582.00,83.061895,83.975780,94.133477,97.039828,91.334769

In [323]:
school_spending['Per Student Budget']=school_spending['Per Student Budget'].replace('[\$,]','', regex=True).astype(float)

C:\Users\sumita\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  if __name__ == '__main__':

school_spending['Per Student Budget']=school_spending.loc[school_spending['Per Student Budget']].replace('[\$,]','', regex=True).astype(float)

In [324]:
school_spending.head(2)

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,582.0,83.061895,83.975780,94.133477,97.039828,91.334769

In [325]:
# Create bins in which to place values based 
bins = [0, 585, 630, 645, 675]
# Create labels for these bins

group_labels = ["< 584", "$585-629", "$630-644", "$645-675"]
# Slice the data and place it into bins
#pd.cut(school_spending["Per Student Budget_T"], bins, labels=group_labels).head()
school_spending['Budget_Bins']=pd.cut(school_spending["Per Student Budget"], bins, labels=group_labels)
school_spending.head()

C:\Users\sumita\Anaconda3\lib\site-packages\ipykernel\__main__.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Budget_Bins
0,628.0,77.048432,81.033963,66.680064,81.933280,54.642283,$585-629
1,582.0,83.061895,83.975780,94.133477,97.039828,91.334769,< 584
2,639.0,76.711767,81.158020,65.988471,80.739234,53.204476,$630-644
3,644.0,77.102592,80.746258,68.309602,79.299014,54.289887,$630-644
4,625.0,83.351499,83.816757,93.392371,97.138965,90.599455,$585-629

In [326]:
# Create a GroupBy object based upon "View Group"
budget_group = school_spending.groupby("Budget_Bins")

In [327]:
budget_math_score_df = pd.DataFrame(budget_group['Average Math Score'].mean())
budget_math_score_df = round(budget_math_score_df['Average Math Score'],2)

budget_math_score_df=budget_math_score_df.reset_index()
budget_math_score_df.head()

  Budget_Bins  Average Math Score
0       < 584               83.46
1    $585-629               81.90
2    $630-644               78.52
3    $645-675               77.00

In [341]:
#Create summary df too columns
spending_sumary_df=budget_math_score_df
spending_sumary_df.head(2)

  Budget_Bins  Average Math Score
0       < 584               83.46
1    $585-629               81.90

In [328]:
budget_reading_score_df = pd.DataFrame(budget_group['Average Reading Score'].mean())
budget_reading_score_df = round(budget_reading_score_df['Average Reading Score'],2)
budget_reading_score_df=budget_reading_score_df.reset_index()
budget_reading_score_df.head()

  Budget_Bins  Average Reading Score
0       < 584                  83.93
1    $585-629                  83.16
2    $630-644                  81.62
3    $645-675                  81.03

In [342]:
spending_sumary_df['Average Reading Score']=budget_reading_score_df['Average Reading Score']
spending_sumary_df.head(2)

  Budget_Bins  Average Math Score  Average Reading Score
0       < 584               83.46                  83.93
1    $585-629               81.90                  83.16

In [333]:
budget_math_pass_df = pd.DataFrame(budget_group['% Passing Math'].mean())
budget_math_pass_df = round(budget_math_pass_df['% Passing Math'],2)
budget_math_pass_df=budget_math_pass_df.reset_index()
budget_math_pass_df.head()

  Budget_Bins  % Passing Math
0       < 584           93.46
1    $585-629           87.13
2    $630-644           73.48
3    $645-675           66.16

In [344]:
spending_sumary_df['% Passing Math']=budget_math_pass_df['% Passing Math']
spending_sumary_df.head(2)

  Budget_Bins  Average Math Score  Average Reading Score  % Passing Math
0       < 584               83.46                  83.93           93.46
1    $585-629               81.90                  83.16           87.13

In [331]:
budget_reading_pass_df = pd.DataFrame(budget_group['% Passing Reading'].mean())
budget_reading_pass_df = round(budget_reading_pass_df['% Passing Reading'],2)
budget_reading_pass_df=budget_reading_pass_df.reset_index()
budget_reading_pass_df.head()

  Budget_Bins  % Passing Reading
0       < 584              96.61
1    $585-629              92.72
2    $630-644              84.39
3    $645-675              81.13

In [345]:
spending_sumary_df['% Passing Readi+ng']=budget_reading_pass_df['% Passing Reading']
spending_sumary_df.head(2)

,Budget_Bins,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading
0,< 584,83.46,83.93,93.46,96.61
1,$585-629,81.90,83.16,87.13,92.72

In [334]:
budget_overall_pass_df = pd.DataFrame(budget_group['% Overall Passing'].mean())
budget_overall_pass_df = round(budget_overall_pass_df['% Overall Passing'],2)
budget_overall_pass_df=budget_overall_pass_df.reset_index()
budget_overall_pass_df.head()

  Budget_Bins  % Overall Passing
0       < 584              90.37
1    $585-629              81.42
2    $630-644              62.86
3    $645-675              53.53

In [348]:
spending_sumary_df['% Overall Passing']=budget_overall_pass_df['% Overall Passing']
spending_sumary_df

,Budget_Bins,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,< 584,83.46,83.93,93.46,96.61,90.37
1,$585-629,81.90,83.16,87.13,92.72,81.42
2,$630-644,78.52,81.62,73.48,84.39,62.86
3,$645-675,77.00,81.03,66.16,81.13,53.53

## Scores by School Size

In [352]:
school_size=school_summary[['Total Students','Average Math Score','Average Reading Score',\
                                '% Passing Math','% Passing Reading','% Overall Passing']]
school_size.head(2)

,Total Students,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,4976.0,77.048432,81.033963,66.680064,81.933280,54.642283
1,1858.0,83.061895,83.975780,94.133477,97.039828,91.334769

In [355]:
# Create bins in which to place values based 
stu_bins = [0, 1000, 2000, 5000]
# Create labels for these bins

size_labels = ["< 1000", "1000 - 2000", "2000 - 5000"]

# Slice the data and place it into bins

school_size['size_bins']=pd.cut(school_size["Total Students"], stu_bins, labels=size_labels)
school_size.head()

C:\Users\sumita\Anaconda3\lib\site-packages\ipykernel\__main__.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,Total Students,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,size_bins
0,4976.0,77.048432,81.033963,66.680064,81.933280,54.642283,2000 - 5000
1,1858.0,83.061895,83.975780,94.133477,97.039828,91.334769,1000 - 2000
2,2949.0,76.711767,81.158020,65.988471,80.739234,53.204476,2000 - 5000
3,2739.0,77.102592,80.746258,68.309602,79.299014,54.289887,2000 - 5000
4,1468.0,83.351499,83.816757,93.392371,97.138965,90.599455,1000 - 2000

# Scores by School Type

In [385]:
# Create a GroupBy object based upon "View Group"
size_group = school_size.groupby("size_bins")

In [386]:
size_math_score_df = pd.DataFrame(size_group['Average Math Score'].mean())
size_math_score_df = round(size_math_score_df['Average Math Score'],2)
size_math_score_df=size_math_score_df.reset_index()
size_math_score_df.head()

     size_bins  Average Math Score
0       < 1000               83.82
1  1000 - 2000               83.37
2  2000 - 5000               77.75

In [387]:
size_summary_df=size_math_score_df
size_summary_df

     size_bins  Average Math Score
0       < 1000               83.82
1  1000 - 2000               83.37
2  2000 - 5000               77.75

In [388]:
size_reading_score_df = pd.DataFrame(size_group['Average Reading Score'].mean())
size_reading_score_df = round(size_reading_score_df['Average Reading Score'],2)
size_reading_score_df=size_reading_score_df.reset_index()
size_reading_score_df.head()

     size_bins  Average Reading Score
0       < 1000                  83.93
1  1000 - 2000                  83.86
2  2000 - 5000                  81.34

In [389]:
size_summary_df['Average Reading Score']=size_reading_score_df['Average Reading Score']
size_summary_df.head(2)

     size_bins  Average Math Score  Average Reading Score
0       < 1000               83.82                  83.93
1  1000 - 2000               83.37                  83.86

In [390]:
size_math_pass_df = pd.DataFrame(size_group['% Passing Math'].mean())
size_math_pass_df = round(size_math_pass_df['% Passing Math'],2)
size_math_pass_df= size_math_pass_df.reset_index()
#size_math_pass_df.head()

size_summary_df['% Passing Math']=size_math_pass_df['% Passing Math']
size_summary_df

     size_bins  Average Math Score  Average Reading Score  % Passing Math
0       < 1000               83.82                  83.93           93.55
1  1000 - 2000               83.37                  83.86           93.60
2  2000 - 5000               77.75                  81.34           69.96

In [391]:
size_reading_pass_df = pd.DataFrame(size_group['% Passing Reading'].mean())
size_reading_pass_df = round(size_reading_pass_df['% Passing Reading'],2)
size_reading_pass_df= size_reading_pass_df.reset_index()
size_reading_pass_df.head()

size_summary_df['% Passing Reading']=budget_reading_pass_df['% Passing Reading']
size_summary_df.head(2)

,size_bins,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading
0,< 1000,83.82,83.93,93.55,96.61
1,1000 - 2000,83.37,83.86,93.60,92.72

In [392]:
size_overall_pass_df = pd.DataFrame(size_group['% Overall Passing'].mean())
size_overall_pass_df = round(size_overall_pass_df['% Overall Passing'],2)
size_overall_pass_df=size_overall_pass_df.reset_index()
size_overall_pass_df.head()

size_summary_df['% Overall Passing']=size_overall_pass_df['% Overall Passing']
size_summary_df

,size_bins,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,< 1000,83.82,83.93,93.55,96.61,89.88
1,1000 - 2000,83.37,83.86,93.60,92.72,90.62
2,2000 - 5000,77.75,81.34,69.96,84.39,58.29

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,89.883853
Medium (1000-2000),83.374684,83.864438,93.599695,96.790680,90.621535
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,58.286003

* Perform the same operations as above, based on school size.

## Scores by School Type

* Perform the same operations as above, based on school type

In [371]:
school_type=school_summary[['type','Average Math Score','Average Reading Score',\
                                '% Passing Math','% Passing Reading','% Overall Passing']]
school_type.head(2)

,type,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,District,77.048432,81.033963,66.680064,81.933280,54.642283
1,Charter,83.061895,83.975780,94.133477,97.039828,91.334769

In [372]:
# Create a GroupBy object based upon "View Group"
type_group = school_type.groupby("type")

In [374]:
type_math_score_df = pd.DataFrame(type_group['Average Math Score'].mean())
type_math_score_df = round(type_math_score_df['Average Math Score'],2)
type_math_score_df=type_math_score_df.reset_index()
type_math_score_df.head()

       type  Average Math Score
0   Charter               83.47
1  District               76.96

In [376]:
type_sumary_df=type_math_score_df
type_sumary_df

       type  Average Math Score
0   Charter               83.47
1  District               76.96

In [377]:
type_reading_score_df = pd.DataFrame(type_group['Average Reading Score'].mean())
type_reading_score_df = round(type_reading_score_df['Average Reading Score'],2)
type_reading_score_df=type_reading_score_df.reset_index()
#type_reading_score_df.head()

type_sumary_df['Average Reading Score']=type_reading_score_df['Average Reading Score']
type_sumary_df

       type  Average Math Score  Average Reading Score
0   Charter               83.47                  83.90
1  District               76.96                  80.97

In [384]:
type_math_pass_df = pd.DataFrame(type_group['% Passing Math'].mean())
type_math_pass_df = round(type_math_pass_df['% Passing Math'],2)
type_math_pass_df=type_math_pass_df.reset_index()
type_math_pass_df.head()

type_sumary_df['% Passing Math']=type_math_pass_df['% Passing Math']
type_sumary_df.head(2)

,type,Average Math Score,Average Reading Score,% Overall Passing,% Passing Readi+ng,% Passing Reading,% Passing Math
0,Charter,83.47,83.90,90.43,96.59,96.59,93.62
1,District,76.96,80.97,53.67,80.80,80.80,66.55

In [380]:
type_reading_pass_df = pd.DataFrame(type_group['% Passing Reading'].mean())
type_reading_pass_df = round(type_reading_pass_df['% Passing Reading'],2)
type_reading_pass_df=type_reading_pass_df.reset_index()
type_reading_pass_df.head()

type_sumary_df['% Passing Reading']=type_reading_pass_df['% Passing Reading']
type_sumary_df.head(2)

,type,Average Math Score,Average Reading Score,% Overall Passing,% Passing Readi+ng,% Passing Reading
0,Charter,83.47,83.90,90.43,96.59,96.59
1,District,76.96,80.97,53.67,80.80,80.80

In [396]:
type_overall_pass_df = pd.DataFrame(type_group['% Overall Passing'].mean())
type_overall_pass_df = round(type_overall_pass_df['% Overall Passing'],2)
type_overall_pass_df=type_overall_pass_df.reset_index()
type_overall_pass_df.head()

type_sumary_df['% Overall Passing']=type_overall_pass_df['% Overall Passing']
type_sumary_df

,type,Average Math Score,Average Reading Score,% Overall Passing,% Passing Readi+ng,% Passing Reading,% Passing Math
0,Charter,83.47,83.90,90.43,96.59,96.59,93.62
1,District,76.96,80.97,53.67,80.80,80.80,66.55

In [398]:
type_sumary_df=type_sumary_df.rename(columns={"type":"School Type"})
type_sumary_df

,School Type,Average Math Score,Average Reading Score,% Overall Passing,% Passing Readi+ng,% Passing Reading,% Passing Math
0,Charter,83.47,83.90,90.43,96.59,96.59,93.62
1,District,76.96,80.97,53.67,80.80,80.80,66.55

In [24]:
type_sumary_df.index=type_sumary_df['School Type']
type_sumary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208